In [2]:
import pandas as pd

In [3]:
# i want to download rand.csv file from randat.com
# using the following column (fullname, lastname, gender, age(18-30), education, occupation, salary(per month))
df = pd.read_csv('data/rand.csv')

In [4]:
df.head()

,First Name,Last Name,Gender,Age,Education,Occupation,Salary,ID
0,Adrianna,Cunningham,Female,21,Primary,Social Worker,856,2460
1,Preston,Cole,Male,26,Bachelor,Interpreter,2326,2924
2,Emma,Elliott,Female,29,Primary,Meteorologist,3814,7283
3,Eddy,Dixon,Male,26,Primary,Graphic Designer,6573,5933
4,Amber,West,Female,25,Bachelor,Dancer,7436,7877

In [5]:
# check for technical info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  100 non-null    object
 1   Last Name   100 non-null    object
 2   Gender      100 non-null    object
 3   Age         100 non-null    int64
 4   Education   100 non-null    object
 5   Occupation  100 non-null    object
 6   Salary      100 non-null    int64
 7   ID          100 non-null    int64
dtypes: int64(3), object(5)
memory usage: 6.4+ KB

In [6]:
# remove a column ID
df.drop(['ID'],axis=1)

,First Name,Last Name,Gender,Age,Education,Occupation,Salary
0,Adrianna,Cunningham,Female,21,Primary,Social Worker,856
1,Preston,Cole,Male,26,Bachelor,Interpreter,2326
2,Emma,Elliott,Female,29,Primary,Meteorologist,3814
3,Eddy,Dixon,Male,26,Primary,Graphic Designer,6573
4,Amber,West,Female,25,Bachelor,Dancer,7436
...,...,...,...,...,...,...,...
95,Rubie,Morgan,Female,26,Doctoral,Interior Designer,9745
96,Joyce,Ellis,Female,21,Lower secondary,Mathematician,7344
97,Ted,Richards,Male,22,Doctoral,Police Officer,8560
98,Daisy,Holmes,Female,29,Lower secondary,Interior Designer,5724
99,John,Phillips,Male,22,Doctoral,Meteorologist,3810

In [7]:
df.columns

Index(['First Name', 'Last Name', 'Gender', 'Age', 'Education', 'Occupation',
       'Salary', 'ID'],
      dtype='object')

In [8]:
# check if the values are unique
df['ID'].is_unique

False

In [9]:
# set the index to the ID column
df = df.set_index('ID')
df.head()

     First Name   Last Name  Gender  Age Education        Occupation  Salary
ID
2460   Adrianna  Cunningham  Female   21   Primary     Social Worker     856
2924    Preston        Cole    Male   26  Bachelor       Interpreter    2326
7283       Emma     Elliott  Female   29   Primary     Meteorologist    3814
5933       Eddy       Dixon    Male   26   Primary  Graphic Designer    6573
7877      Amber        West  Female   25  Bachelor            Dancer    7436

In [10]:
# check the missing values
# df.isna().sum()
# df.isnull()
df.isnull().sum()

First Name    0
Last Name     0
Gender        0
Age           0
Education     0
Occupation    0
Salary        0
dtype: int64

In [11]:
# check the rows containing the missing values
df[df['Age'].isna()]

Empty DataFrame
Columns: [First Name, Last Name, Gender, Age, Education, Occupation, Salary]
Index: []

In [12]:
# dropping the rows containing missing values
df1 = df.dropna()

In [13]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 2460 to 3662
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  100 non-null    object
 1   Last Name   100 non-null    object
 2   Gender      100 non-null    object
 3   Age         100 non-null    int64
 4   Education   100 non-null    object
 5   Occupation  100 non-null    object
 6   Salary      100 non-null    int64
dtypes: int64(2), object(5)
memory usage: 6.2+ KB

In [14]:
df['Age']

ID
2460    21
2924    26
7283    29
5933    26
7877    25
        ..
7985    26
2209    21
9223    22
5909    29
3662    22
Name: Age, Length: 100, dtype: int64

In [15]:
# filing the empty cells with the average age
df['Age'] = df['Age'].fillna(df['Age'].mean())
# df['Age'] = df['Age'].fillna(30)
# df['Age'].mean()

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 2460 to 3662
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  100 non-null    object
 1   Last Name   100 non-null    object
 2   Gender      100 non-null    object
 3   Age         100 non-null    int64
 4   Education   100 non-null    object
 5   Occupation  100 non-null    object
 6   Salary      100 non-null    int64
dtypes: int64(2), object(5)
memory usage: 6.2+ KB

In [17]:
# Converting to integer datatype
df['Age'] = df['Age'].astype('int')
# df['Age'].dtype

In [27]:
# convert DOB to datetime datatype
df['Age'] = pd.to_datetime(df['Age'])

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 2460 to 3662
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  100 non-null    object
 1   Last Name   100 non-null    object
 2   Gender      100 non-null    object
 3   Age         100 non-null    int64
 4   Education   100 non-null    object
 5   Occupation  100 non-null    object
 6   Salary      100 non-null    int64
dtypes: int64(2), object(5)
memory usage: 6.2+ KB

In [19]:
# recheck the DOB column
df.head()

     First Name   Last Name  Gender  Age Education        Occupation  Salary
ID
2460   Adrianna  Cunningham  Female   21   Primary     Social Worker     856
2924    Preston        Cole    Male   26  Bachelor       Interpreter    2326
7283       Emma     Elliott  Female   29   Primary     Meteorologist    3814
5933       Eddy       Dixon    Male   26   Primary  Graphic Designer    6573
7877      Amber        West  Female   25  Bachelor            Dancer    7436

In [20]:
# count the different values in a series (column)
df['Gender'].value_counts()

Gender
Male      51
Female    49
Name: count, dtype: int64

In [21]:
# using replace method
df['Gender'] = df['Gender'].replace('Mile','Male')

In [22]:
# converting to category datatype
df['Gender'] = df['Gender'].astype('category')

In [23]:
df['Gender'].dtype

CategoricalDtype(categories=['Female', 'Male'], ordered=False, categories_dtype=object)

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 2460 to 3662
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  100 non-null    object
 1   Last Name   100 non-null    object
 2   Gender      100 non-null    category
 3   Age         100 non-null    int64
 4   Education   100 non-null    object
 5   Occupation  100 non-null    object
 6   Salary      100 non-null    int64
dtypes: category(1), int64(2), object(4)
memory usage: 5.7+ KB

In [25]:
# dropping two columns
df = df.drop(columns=['Education','Occupation'])

In [26]:
# getting the name of columns
df.columns

Index(['First Name', 'Last Name', 'Gender', 'Age', 'Salary'], dtype='object')

In [28]:
df.head(2)

     First Name   Last Name  Gender                           Age  Salary
ID
2460   Adrianna  Cunningham  Female 1970-01-01 00:00:00.000000021     856
2924    Preston        Cole    Male 1970-01-01 00:00:00.000000026    2326

In [49]:
# using loc to locate rows
# Select * From Small Where ID='2460'
# Select Salary from small where ID='2460'
# df.loc[2460]
# df.loc[df['Gender']=='Male']
df.loc[2460]
# df.loc[2460,'Salary']
# df.loc[1000:1009, 'Salary']

First Name                         Adrianna
Last Name                        Cunningham
Gender                               Female
Age           1970-01-01 00:00:00.000000021
Salary                                  856
Name: 2460, dtype: object

In [ ]:
# using iloc for unlabeled index
df.iloc[0:5]

In [ ]:
# using at to locate specific values like salary
df.at[1007, 'Salary']